tap "anomalyco/tap"
tap "ddev/ddev"
tap "hashicorp/tap"
tap "opencoworkai/tap", "https://github.com/OpenCoworkAI/homebrew-tap"
tap "steipete/tap"
tap "yakitrak/yakitrak"
tap "zackriya-solutions/meetily"
# OpenType text shaping engine
brew "harfbuzz"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Gnome disk usage analyzer
brew "baobab"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Emacs dependency management
brew "cask"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Access and convert several ebook formats
brew "ebook-tools"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# New file format for still image compression
brew "jpeg-xl"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go manage your Ollama models
brew "gollama"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Client library for huggingface.co hub
brew "hf"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Convert ebooks from epub to kepub
brew "kepubify"
# Lazier way to manage everything docker
brew "lazydocker"
# Postgres C API library
brew "libpq"
# C library for files containing sampled sound
brew "libsndfile"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# Mac App Store command-line interface
brew "mas"
# CLI utility that generates PDF from Markdown
brew "md2pdf"
# Command-line interface to split MP3 and Ogg Vorbis files
brew "mp3splt"
# Mongrel of mail user agents (part elm, pine, mush, mh, etc.)
brew "mutt"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# General-purpose speech recognition model
brew "openai-whisper"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Generic machine emulator and virtualizer
brew "qemu"
# Rsync for cloud storage
brew "rclone"
# Acoustic spectrum analyser
brew "spek"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Application uninstaller
cask "appcleaner"
# Alternative GUI for Time Machine
cask "backuploupe"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Server and cloud storage browser
cask "cyberduck"
# Window peeking utility app
cask "dockdoor"
# Per-application volume mixer, equalizer, and audio router
cask "finetune"
# Privacy-focused Firefox-based browser
cask "floorp"
cask "font-jetbrains-mono-nerd-font"
# Open-source video transcoder
cask "handbrake-app"
# File archiver
cask "keka"
# Open-source keystroke visualiser
cask "keycastr"
# Audio tagger focusing on efficiency
cask "kid3"
# Customise mouse behavior
cask "linearmouse"
# Clipboard manager
cask "maccy"
# Markdown editor
cask "markedit"
# Extensible two-pane file manager
cask "marta"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Minimal installer for conda
cask "miniconda"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Utility to move and zoom windows—on one display
cask "moom"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# App to write, plan, collaborate, and get organised
cask "notion"
# Desktop AI agent app with sandboxed environment
cask "opencoworkai/tap/open-cowork"
# AI coding agent desktop client
cask "opencode-desktop"
# Geographic Information System
cask "qgis"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Catalogue of hi-res music for streaming and download
cask "qobuz"
# Team communication and collaboration software
cask "slack"
# Native terminal coding agents command center
cask "supacode"
# Python IDE for beginners
cask "thonny"
# Utility to change the default backup interval of Time Machine
cask "timemachineeditor"
# Free and open-source OpenVPN client
cask "tunnelblick"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Bluetooth Inspector", id: 1509085044
mas "Copilot", id: 6738511300
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "GarageBand", id: 682658836
mas "Home Assistant", id: 1099568401
mas "Horo", id: 1437226581
mas "iMovie", id: 408981434
mas "Integrity", id: 513610341
mas "Klack", id: 6446206067
mas "Microsoft To Do", id: 1274495053
mas "Muteem", id: 6463294724
mas "Owly", id: 882812218
mas "Scrivener", id: 1310686187
mas "SiteSucker", id: 442168834
mas "Steam Link", id: 1246969117
mas "TestFlight", id: 899247664
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "World Clock", id: 956377119
mas "Xcode", id: 497799835
vscode "anthropic.claude-code"
vscode "chaojie.better-mako"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "jakebathman.mysql-syntax"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.powershell"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.liveserver"
vscode "stylelint.vscode-stylelint"
vscode "tomoki1207.pdf"
vscode "uctakeoff.vscode-counter"
vscode "yzane.markdown-pdf"
vscode "zainchen.json"
go "github.com/sammcj/gollama"
go "github.com/rapidloop/rtop"
npm "@mariozechner/pi-coding-agent"
npm "@playwright/cli"
npm "agent-browser"
npm "broken-link-checker"
npm "clawdhub"
npm "corepack"
npm "grunt-cli"
npm "obsidian-to-notion"
