tap "anomalyco/tap"
tap "ddev/ddev"
tap "hashicorp/tap"
tap "steipete/tap"
tap "yakitrak/yakitrak"
tap "zackriya-solutions/meetily"
brew "harfbuzz"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "autossh"
brew "azure-cli"
brew "baobab"
brew "blueutil"
brew "btop"
brew "cask"
brew "cloudflared"
brew "libssh2"
brew "curl"
brew "docker-credential-helper"
brew "ebook-tools"
brew "eza"
brew "ffmpeg"
brew "libsndfile"
brew "gh"
brew "git-lfs"
brew "go"
brew "gollama"
brew "graphviz"
brew "htop"
brew "httpie"
brew "iperf"
brew "iperf3"
brew "jq"
brew "kepubify"
brew "lazydocker"
brew "libpq"
brew "mas"
brew "mp3splt"
brew "mutt"
brew "mysql-client"
brew "newsboat"
brew "openai-whisper"
brew "openjdk"
brew "pandoc"
brew "php"
brew "qemu"
brew "rclone"
brew "spek"
brew "telnet"
brew "uv"
brew "watch"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "ddev/ddev/ddev"
brew "hashicorp/tap/terraform"
brew "steipete/tap/imsg"
brew "steipete/tap/remindctl"
brew "yakitrak/yakitrak/obsidian-cli"
cask "appcleaner"
cask "avidemux"
cask "backuploupe"
cask "codex"
cask "cyberduck"
cask "handbrake-app"
cask "keka"
cask "keycastr"
cask "linearmouse"
cask "maccy"
cask "mactex"
cask "marta"
cask "meetingbar"
cask "miniconda"
cask "monitorcontrol"
cask "moom"
cask "multipass"
cask "notion"
cask "opencode-desktop"
cask "orbstack"
cask "qgis"
cask "qlmarkdown"
cask "qobuz"
cask "slack"
cask "timemachineeditor"
cask "tunnelblick"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Copilot", id: 6738511300
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "GarageBand", id: 682658836
mas "Home Assistant", id: 1099568401
mas "Horo", id: 1437226581
mas "iMovie", id: 408981434
mas "Integrity", id: 513610341
mas "Microsoft To Do", id: 1274495053
mas "Muteem", id: 6463294724
mas "Owly", id: 882812218
mas "Scrivener", id: 1310686187
mas "SiteSucker", id: 442168834
mas "Steam Link", id: 1246969117
mas "TestFlight", id: 899247664
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "World Clock", id: 956377119
vscode "anseki.vscode-color"
vscode "anthropic.claude-code"
vscode "balduinlandolt.surround-with-tag"
vscode "bbenoist.vagrant"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "chaojie.better-mako"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "ginfuru.ginfuru-vscode-jekyll-syntax"
vscode "ginfuru.vscode-jekyll-snippets"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "glenn2223.live-sass"
vscode "google.geminicodeassist"
vscode "jakebathman.mysql-syntax"
vscode "janisdd.vscode-edit-csv"
vscode "jinsihou.diff-tool"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mrmlnc.vscode-apache"
vscode "mrorz.language-gettext"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "natizyskunk.sftp"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "sst-dev.opencode"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "thomas-baumgaertner.vcl"
vscode "uctakeoff.vscode-counter"
vscode "wmaurer.change-case"
vscode "wordpresstoolbox.wordpress-toolbox"
vscode "xdebug.php-debug"
vscode "yy0931.save-as-root"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
go "github.com/sammcj/gollama"
go "github.com/rapidloop/rtop"
