tap "homebrew/bundle"
tap "homebrew/services"
brew "openssl@3"
brew "azure-cli"
brew "blueutil"
brew "qemu"
brew "lima"
brew "colima"
brew "libssh2"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "eza"
brew "harfbuzz"
brew "libsndfile"
brew "ffmpeg"
brew "git-lfs"
brew "go"
brew "htop"
brew "httpie"
brew "iperf"
brew "iperf3"
brew "mas"
brew "mp3splt"
brew "mutt"
brew "node"
brew "ollama", restart_service: true
brew "openjdk"
brew "php@8.1"
brew "rclone"
brew "telnet"
brew "tldr"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "appcleaner"
cask "backuploupe"
cask "cyberduck"
cask "handbrake"
cask "keka"
cask "keycastr"
cask "maccy"
cask "miniconda"
cask "monitorcontrol"
cask "moom"
cask "multipass"
cask "notion"
cask "qlmarkdown"
cask "qobuz"
cask "slack"
cask "timemachineeditor"
cask "tunnelblick"
mas "Bitwarden", id: 1352778147
mas "Day One", id: 1055511498
mas "Divvy", id: 413857545
mas "GarageBand", id: 682658836
mas "Hand Mirror", id: 1502839586
mas "Home Assistant", id: 1099568401
mas "Horo", id: 1437226581
mas "iMovie", id: 408981434
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "NotePlan", id: 1505432629
mas "Owly", id: 882812218
mas "Scrivener 3", id: 1310686187
mas "SiteSucker", id: 442168834
mas "Steam Link", id: 1246969117
mas "TestFlight", id: 899247664
mas "WireGuard", id: 1451685025
mas "World Clock", id: 956377119
vscode "anseki.vscode-color"
vscode "balduinlandolt.surround-with-tag"
vscode "bbenoist.vagrant"
vscode "bradlc.vscode-tailwindcss"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "ginfuru.ginfuru-vscode-jekyll-syntax"
vscode "ginfuru.vscode-jekyll-snippets"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "glenn2223.live-sass"
vscode "jakebathman.mysql-syntax"
vscode "jinsihou.diff-tool"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mrmlnc.vscode-apache"
vscode "mrorz.language-gettext"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "natizyskunk.sftp"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "pdconsec.vscode-print"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "stylelint.vscode-stylelint"
vscode "thomas-baumgaertner.vcl"
vscode "tommorris.mako"
vscode "wingrunr21.vscode-ruby"
vscode "wmaurer.change-case"
vscode "wordpresstoolbox.wordpress-toolbox"
vscode "xdebug.php-debug"
vscode "yy0931.save-as-root"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
